In [ ]:
import pandas as pd
import random
import numpy as np

random.seed(42)

num_records = 200
employee_ids = range(1, num_records + 1)
names = [f'Employee_{i}' for i in employee_ids]
ages = [random.randint(22, 60) for _ in range(num_records)]
departments = random.choices(['HR', 'IT', 'Finance', 'Marketing', 'Sales'], k=num_records)
salaries = [random.randint(30000, 120000) for _ in range(num_records)]


for _ in range(20):
    idx = random.randint(0, num_records - 1)
    ages[idx] = None

for _ in range(15):
    idx = random.randint(0, num_records - 1)
    salaries[idx] = None


employee_data = pd.DataFrame({
    'EmployeeID': employee_ids,
    'Name': names,
    'Age': ages,
    'Department': departments,
    'Salary': salaries
})

employee_data.to_csv('employee_data.csv', index=False)
print("employee_data.csv has been created with 200 records and intentional missing values.")

employee_data.csv has been created with 200 records and intentional missing values.

In [ ]:
df = pd.read_csv('employee_data.csv')

print("First 5 rows:")
print(df.head())
print("\nLast 5 rows:")
print(df.tail())
print("\nShape of the DataFrame:", df.shape)
print("\nDataFrame Info:")
print(df.info())

First 5 rows:
   EmployeeID        Name   Age Department    Salary
0           1  Employee_1  29.0  Marketing   71114.0
1           2  Employee_2  23.0         HR   87199.0
2           3  Employee_3  39.0         HR  109457.0
3           4  Employee_4  37.0         HR   97033.0
4           5  Employee_5   NaN         IT   45157.0

Last 5 rows:
     EmployeeID          Name   Age Department    Salary
195         196  Employee_196  36.0    Finance  114246.0
196         197  Employee_197  59.0      Sales   86179.0
197         198  Employee_198  36.0         HR   47786.0
198         199  Employee_199  22.0    Finance   90515.0
199         200  Employee_200  26.0         IT       NaN

Shape of the DataFrame: (200, 5)

DataFrame Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmployeeID  200 non-null    int64
 1   Name        200 non-null    object
 2   Age         182 non-null    float64
 3   Department  200 non-null    object
 4   Salary      186 non-null    float64
dtypes: float64(2), int64(1), object(2)
memory usage: 7.9+ KB
None

In [ ]:
print("\nBasic Statistics:")
print(df.describe())

mean_salary = df['Salary'].mean()
median_salary = df['Salary'].median()
min_salary = df['Salary'].min()
max_salary = df['Salary'].max()

print(f"\nMean Salary: {mean_salary}")
print(f"Median Salary: {median_salary}")
print(f"Min Salary: {min_salary}")
print(f"Max Salary: {max_salary}")

non_numeric_columns = df.select_dtypes(exclude=[np.number]).columns.tolist()
print("\nNon-numeric columns:", non_numeric_columns)

Basic Statistics:
       EmployeeID         Age         Salary
count  200.000000  182.000000     186.000000
mean   100.500000   40.989011   78798.360215
std     57.879185   11.636288   24991.261167
min      1.000000   22.000000   30053.000000
25%     50.750000   31.000000   58796.500000
50%    100.500000   39.000000   82563.000000
75%    150.250000   51.000000   99910.000000
max    200.000000   60.000000  119016.000000

Mean Salary: 78798.36021505376
Median Salary: 82563.0
Min Salary: 30053.0
Max Salary: 119016.0

Non-numeric columns: ['Name', 'Department']

In [ ]:
missing_values = df.isna().sum()
print("\nMissing values in each column:")
print(missing_values)

df_dropped = df.dropna(subset=['Age', 'Salary'])

df_filled = df.copy()
df_filled['Age'].fillna(df_filled['Age'].mean(), inplace=True)
df_filled['Salary'].fillna(df_filled['Salary'].mean(), inplace=True)

print("\nDataFrame after dropping missing values:")
print(df_dropped.info())
print("\nDataFrame after filling missing values:")
print(df_filled.info())

Missing values in each column:
EmployeeID     0
Name           0
Age           18
Department     0
Salary        14
dtype: int64

DataFrame after dropping missing values:
<class 'pandas.core.frame.DataFrame'>
Index: 168 entries, 0 to 198
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmployeeID  168 non-null    int64
 1   Name        168 non-null    object
 2   Age         168 non-null    float64
 3   Department  168 non-null    object
 4   Salary      168 non-null    float64
dtypes: float64(2), int64(1), object(2)
memory usage: 7.9+ KB
None

DataFrame after filling missing values:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmployeeID  200 non-null    int64
 1   Name        200 non-null    object
 2   Age         200 non-null    float64
 3   Department  200 non-null    object
 4   Salary      200 non-null    float64
dtypes: float64(2), int64(1), object(2)
memory usage: 7.9+ KB
None

<ipython-input-4-39d0d4676760>:8: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_filled['Age'].fillna(df_filled['Age'].mean(), inplace=True)
<ipython-input-4-39d0d4676760>:9: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_filled['Salary'].fillna(df_filled['Salary'].mean(), inplace=True)

In [ ]:
missing_department = df[df['Department'].isna()]
non_missing_department = df[df['Department'].notna()]

print("\nEmployees with missing department:")
print(missing_department)

age_filtered = df[(df['Age'] >= 30) & (df['Age'] <= 40)]
print("\nEmployees aged between 30 and 40:")
print(age_filtered)

df['City'] = random.choices(['New York', 'Los Angeles', 'Chicago', None], k=num_records)
high_salary_non_missing_city = df[(df['Salary'] > 100000) & (df['City'].notna())]
print("\nEmployees with salary > 100,000 and non-missing city:")
print(high_salary_non_missing_city)

Employees with missing department:
Empty DataFrame
Columns: [EmployeeID, Name, Age, Department, Salary]
Index: []

Employees aged between 30 and 40:
     EmployeeID          Name   Age Department    Salary
2             3    Employee_3  39.0         HR  109457.0
3             4    Employee_4  37.0         HR   97033.0
5             6    Employee_6  30.0    Finance       NaN
14           15   Employee_15  35.0    Finance  117900.0
15           16   Employee_16  36.0         HR   55825.0
23           24   Employee_24  36.0         HR  116951.0
26           27   Employee_27  39.0         HR   96469.0
28           29   Employee_29  32.0    Finance  117410.0
31           32   Employee_32  39.0    Finance   82743.0
32           33   Employee_33  31.0      Sales   68752.0
33           34   Employee_34  35.0         HR  102667.0
42           43   Employee_43  38.0         IT  104593.0
50           51   Employee_51  40.0      Sales   86346.0
53           54   Employee_54  34.0  Marketing  115813.0
56           57   Employee_57  36.0  Marketing   87905.0
57           58   Employee_58  40.0    Finance       NaN
59           60   Employee_60  36.0         IT   58010.0
62           63   Employee_63  39.0         HR   52241.0
65           66   Employee_66  32.0    Finance   67196.0
68           69   Employee_69  35.0         HR  112960.0
69           70   Employee_70  39.0    Finance  111167.0
72           73   Employee_73  32.0         HR   60784.0
74           75   Employee_75  37.0    Finance   70687.0
75           76   Employee_76  32.0      Sales   59444.0
78           79   Employee_79  39.0         HR   33201.0
80           81   Employee_81  36.0  Marketing   62092.0
87           88   Employee_88  39.0         HR  105454.0
89           90   Employee_90  35.0    Finance       NaN
92           93   Employee_93  35.0         HR   61979.0
96           97   Employee_97  31.0    Finance   43970.0
98           99   Employee_99  30.0         HR   58683.0
99          100  Employee_100  37.0         IT   53053.0
102         103  Employee_103  38.0         IT   36582.0
108         109  Employee_109  36.0    Finance   90901.0
109         110  Employee_110  30.0  Marketing  117500.0
115         116  Employee_116  31.0      Sales  110301.0
125         126  Employee_126  38.0      Sales  113579.0
130         131  Employee_131  39.0         IT   61358.0
133         134  Employee_134  40.0         HR   40155.0
135         136  Employee_136  32.0  Marketing   60735.0
140         141  Employee_141  33.0         HR   40561.0
146         147  Employee_147  34.0         IT   58043.0
147         148  Employee_148  31.0      Sales   38418.0
149         150  Employee_150  32.0         HR   83424.0
160         161  Employee_161  37.0         HR  105456.0
162         163  Employee_163  37.0         HR   92518.0
169         170  Employee_170  30.0  Marketing  101582.0
170         171  Employee_171  30.0         IT  109069.0
173         174  Employee_174  32.0         IT   58760.0
174         175  Employee_175  38.0         HR   65774.0
178         179  Employee_179  35.0         IT   80968.0
180         181  Employee_181  34.0      Sales  117670.0
188         189  Employee_189  37.0    Finance   33534.0
189         190  Employee_190  36.0  Marketing   81645.0
195         196  Employee_196  36.0    Finance  114246.0
197         198  Employee_198  36.0         HR   47786.0

Employees with salary > 100,000 and non-missing city:
     EmployeeID          Name   Age Department    Salary         City
2             3    Employee_3  39.0         HR  109457.0      Chicago
6             7    Employee_7  28.0         IT  105574.0     New York
13           14   Employee_14   NaN    Finance  100575.0     New York
14           15   Employee_15  35.0    Finance  117900.0  Los Angeles
19           20   Employee_20  57.0      Sales  117062.0     New York
21           22   Employee_22  56.0  Marketing  111678.0      Chicago
33           34   Employee_34  35.0         HR  102667.0  Los Angeles
41           42   Employee_42  60.0  Marketing  110676.0  Los Angeles
42           43   Employee_43  38.0         IT  104593.0      Chicago
53           54   Employee_54  34.0  Marketing  115813.0     New York
58           59   Employee_59  27.0         HR  118555.0  Los Angeles
67           68   Employee_68  44.0    Finance  117012.0  Los Angeles
68           69   Employee_69  35.0         HR  112960.0     New York
82           83   Employee_83  25.0         IT  110120.0      Chicago
86           87   Employee_87   NaN         IT  112544.0      Chicago
87           88   Employee_88  39.0         HR  105454.0  Los Angeles
94           95   Employee_95  47.0    Finance  115990.0      Chicago
103         104  Employee_104  59.0    Finance  103060.0     New York
109         110  Employee_110  30.0  Marketing  117500.0  Los Angeles
111         112  Employee_112  53.0      Sales  103259.0      Chicago
112         113  Employee_113  27.0         HR  108047.0      Chicago
115         116  Employee_116  31.0      Sales  110301.0  Los Angeles
118         119  Employee_119  60.0         IT  101810.0  Los Angeles
125         126  Employee_126  38.0      Sales  113579.0  Los Angeles
129         130  Employee_130  56.0         HR  112149.0     New York
139         140  Employee_140  54.0  Marketing  100798.0  Los Angeles
151         152  Employee_152  55.0  Marketing  101121.0     New York
158         159  Employee_159  45.0      Sales  106556.0     New York
160         161  Employee_161  37.0         HR  105456.0      Chicago
168         169  Employee_169  56.0  Marketing  100545.0  Los Angeles
169         170  Employee_170  30.0  Marketing  101582.0      Chicago
170         171  Employee_171  30.0         IT  109069.0      Chicago
180         181  Employee_181  34.0      Sales  117670.0      Chicago
181         182  Employee_182  41.0         IT  119016.0      Chicago
186         187  Employee_187  50.0  Marketing  111560.0     New York
187         188  Employee_188  29.0         IT  100008.0  Los Angeles
190         191  Employee_191  26.0      Sales  107580.0     New York

In [ ]:
sorted_df = df.sort_values(by=['Department', 'Age'], ascending=[True, True])
print("\nSorted DataFrame by Department and Age:")
print(sorted_df.head(10))

top_5_salaries = df.nlargest(5, 'Salary')
bottom_5_salaries = df.nsmallest(5, 'Salary')

print("\nTop 5 Salaries:")
print(top_5_salaries[['Name', 'Salary']])
print("\nBottom 5 Salaries:")
print(bottom_5_salaries[['Name', 'Salary']])

df['Salary_Rank'] = df['Salary'].rank(ascending=False)
print("\nDataFrame with Salary Rank:")
print(df[['Name', 'Salary', 'Salary_Rank']].head(10))

Sorted DataFrame by Department and Age:
     EmployeeID          Name   Age Department    Salary      City
198         199  Employee_199  22.0    Finance   90515.0  New York
18           19   Employee_19  23.0    Finance   39171.0   Chicago
11           12   Employee_12  24.0    Finance   30221.0      None
43           44   Employee_44  24.0    Finance   69446.0      None
167         168  Employee_168  26.0    Finance   84921.0      None
8             9    Employee_9  27.0    Finance   63386.0   Chicago
38           39   Employee_39  28.0    Finance   79695.0   Chicago
5             6    Employee_6  30.0    Finance       NaN      None
96           97   Employee_97  31.0    Finance   43970.0  New York
28           29   Employee_29  32.0    Finance  117410.0      None

Top 5 Salaries:
             Name    Salary
181  Employee_182  119016.0
58    Employee_59  118555.0
73    Employee_74  118184.0
14    Employee_15  117900.0
180  Employee_181  117670.0

Bottom 5 Salaries:
             Name   Salary
46    Employee_47  30053.0
11    Employee_12  30221.0
95    Employee_96  30726.0
163  Employee_164  30772.0
78    Employee_79  33201.0

DataFrame with Salary Rank:
          Name    Salary  Salary_Rank
0   Employee_1   71114.0        113.0
1   Employee_2   87199.0         77.0
2   Employee_3  109457.0         27.0
3   Employee_4   97033.0         53.0
4   Employee_5   45157.0        166.0
5   Employee_6       NaN          NaN
6   Employee_7  105574.0         32.0
7   Employee_8       NaN          NaN
8   Employee_9   63386.0        129.0
9  Employee_10   35817.0        179.0

In [ ]:
df['Monthly_Salary'] = df['Salary'] / 12

def age_bracket(age):
    if age < 30:
        return 'Young'
    elif 30 <= age < 50:
        return 'MidCareer'
    else:
        return 'Senior'

df['Age_Bracket'] = df['Age'].apply(age_bracket)

df[['First_Name', 'Last_Name']] = df['Name'].str.split('_', expand=True)
print("\nDataFrame with new columns:")
print(df[['Name', 'First_Name', 'Last_Name', 'Monthly_Salary', 'Age_Bracket']].head(10))

DataFrame with new columns:
          Name First_Name Last_Name  Monthly_Salary Age_Bracket
0   Employee_1   Employee         1     5926.166667       Young
1   Employee_2   Employee         2     7266.583333       Young
2   Employee_3   Employee         3     9121.416667   MidCareer
3   Employee_4   Employee         4     8086.083333   MidCareer
4   Employee_5   Employee         5     3763.083333      Senior
5   Employee_6   Employee         6             NaN   MidCareer
6   Employee_7   Employee         7     8797.833333       Young
7   Employee_8   Employee         8             NaN      Senior
8   Employee_9   Employee         9     5282.166667       Young
9  Employee_10   Employee        10     2984.750000      Senior

In [ ]:
grouped_df = df.groupby('Department').agg({'Age': 'mean', 'Salary': 'sum'}).reset_index()
grouped_df.columns = ['Department', 'Average_Age', 'Total_Salary']
print("\nGrouped DataFrame by Department:")
print(grouped_df)

employee_count_by_city = df['City'].value_counts().reset_index()
employee_count_by_city.columns = ['City', 'Employee_Count']
print("\nEmployee Count by City:")
print(employee_count_by_city)

highest_mean_salary_department = df.groupby('Department')['Salary'].mean().idxmax()
print(f"\nDepartment with the highest mean salary: {highest_mean_salary_department}")

Grouped DataFrame by Department:
  Department  Average_Age  Total_Salary
0    Finance    40.342105     2766273.0
1         HR    39.804348     3668554.0
2         IT    41.967742     2625763.0
3  Marketing    41.515152     2756321.0
4      Sales    41.911765     2839584.0

Employee Count by City:
          City  Employee_Count
0      Chicago              56
1     New York              51
2  Los Angeles              46

Department with the highest mean salary: Marketing

In [ ]:
dept_info = pd.DataFrame({
    'Department': ['HR', 'IT', 'Finance', 'Marketing', 'Sales'],
    'Manager': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Budget': [500000, 700000, 600000, 400000, 300000]
})

inner_merge = pd.merge(df, dept_info, on='Department', how='inner')
left_merge = pd.merge(df, dept_info, on='Department', how='left')
right_merge = pd.merge(df, dept_info, on='Department', how='right')
outer_merge = pd.merge(df, dept_info, on='Department', how='outer')

print("\nInner Merge Result:")
print(inner_merge.head())

print("\nLeft Merge Result:")
print(left_merge.head())

print("\nRight Merge Result:")
print(right_merge.head())

print("\nOuter Merge Result:")
print(outer_merge.head())

Inner Merge Result:
   EmployeeID        Name   Age Department    Salary      City  Salary_Rank  \
0           1  Employee_1  29.0  Marketing   71114.0  New York        113.0
1           2  Employee_2  23.0         HR   87199.0   Chicago         77.0
2           3  Employee_3  39.0         HR  109457.0   Chicago         27.0
3           4  Employee_4  37.0         HR   97033.0  New York         53.0
4           5  Employee_5   NaN         IT   45157.0   Chicago        166.0

   Monthly_Salary Age_Bracket First_Name Last_Name Manager  Budget
0     5926.166667       Young   Employee         1   David  400000
1     7266.583333       Young   Employee         2   Alice  500000
2     9121.416667   MidCareer   Employee         3   Alice  500000
3     8086.083333   MidCareer   Employee         4   Alice  500000
4     3763.083333      Senior   Employee         5     Bob  700000

Left Merge Result:
   EmployeeID        Name   Age Department    Salary      City  Salary_Rank  \
0           1  Employee_1  29.0  Marketing   71114.0  New York        113.0
1           2  Employee_2  23.0         HR   87199.0   Chicago         77.0
2           3  Employee_3  39.0         HR  109457.0   Chicago         27.0
3           4  Employee_4  37.0         HR   97033.0  New York         53.0
4           5  Employee_5   NaN         IT   45157.0   Chicago        166.0

   Monthly_Salary Age_Bracket First_Name Last_Name Manager  Budget
0     5926.166667       Young   Employee         1   David  400000
1     7266.583333       Young   Employee         2   Alice  500000
2     9121.416667   MidCareer   Employee         3   Alice  500000
3     8086.083333   MidCareer   Employee         4   Alice  500000
4     3763.083333      Senior   Employee         5     Bob  700000

Right Merge Result:
   EmployeeID         Name   Age Department    Salary      City  Salary_Rank  \
0           2   Employee_2  23.0         HR   87199.0   Chicago         77.0
1           3   Employee_3  39.0         HR  109457.0   Chicago         27.0
2           4   Employee_4  37.0         HR   97033.0  New York         53.0
3          16  Employee_16  36.0         HR   55825.0   Chicago        147.0
4          21  Employee_21   NaN         HR   73279.0   Chicago        107.0

   Monthly_Salary Age_Bracket First_Name Last_Name Manager  Budget
0     7266.583333       Young   Employee         2   Alice  500000
1     9121.416667   MidCareer   Employee         3   Alice  500000
2     8086.083333   MidCareer   Employee         4   Alice  500000
3     4652.083333   MidCareer   Employee        16   Alice  500000
4     6106.583333      Senior   Employee        21   Alice  500000

Outer Merge Result:
   EmployeeID         Name   Age Department    Salary      City  Salary_Rank  \
0           6   Employee_6  30.0    Finance       NaN      None          NaN
1           8   Employee_8  56.0    Finance       NaN   Chicago          NaN
2           9   Employee_9  27.0    Finance   63386.0   Chicago        129.0
3          12  Employee_12  24.0    Finance   30221.0      None        185.0
4          14  Employee_14   NaN    Finance  100575.0  New York         45.0

   Monthly_Salary Age_Bracket First_Name Last_Name  Manager  Budget
0             NaN   MidCareer   Employee         6  Charlie  600000
1             NaN      Senior   Employee         8  Charlie  600000
2     5282.166667       Young   Employee         9  Charlie  600000
3     2518.416667       Young   Employee        12  Charlie  600000
4     8381.250000      Senior   Employee        14  Charlie  600000